Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Вдобавок к этому, иногда требовалось принудительно сбросить кэш пакетов, опубликованных через Loginom Integrator, например, при обновлении версий сразу нескольких пакетов.
en: Besides, sometimes it was required to clear cache of the packages published by means of Loginom Integrator forcedly, for example, when updating versions of several packages at once.

source: Версия должна иметь формат: Мажорная.Минорная.Патч[-ПредрелизнаяВерсия][+СборочныеМетаданные]».
en: The version must have the following format: Major.Minor.Patch[-GM version][+Assembly Metadata]".

source: Весь код выполняется на сервере с правами пользователя операционной системы, от имени которого запущен Loginom Server.
en: The whole code is executed on server with rights of the operational system user under whose id Loginom Server is started.

source: Визуализатор «Дуликаты и противоречия»
en: Duplicates and Contradictions Visualizer

source: Визуализатор «Куб»
en: "Cube" Visualizer

source: Визуализатор позволяет проанализировать набор данных и оценить качество этих данных с выводом возможных проблем по каждому полю.
en: The visualizer enables to analyse data set and access quality of this data specifying possible problems for each field.

source: Визуализаторы
en: Visualizers

source: Включен перенос строк сообщения в модальных окнах, что исключает некорректное отображение (#7081).
en: Break of the message lines was enabled in the modal windows. It excludes the incorrect display (#7081).

source: Вместе с тем 80% серверной части было перенесено с предыдущей версии, а клиентская часть не претерпела значительных изменений, поэтому сценарии, подготовленные в Loginom под Windows, будут работать и под Linux, в некоторых случаях потребуется лишь перенастройка узлов.
en: At the same time, 80% percent of the server part was transferred from the previous version, and the client part was not significantly changed. That is why the workflows prepared in Loginom for Windows will be used with Linux as well. In some cases only reconfiguration of nodes will be required.

source: Вместо */* установлено application/json.
en: Instead of */* application/json was installed.

source: Вместо встроенных функций Windows используется библиотека ICU — International Components for Unicode, которая обеспечивает одинаковые результаты работы со строками на разных платформах.
en: ICU library — International Components for Unicode is used instead of built-in Windows functions. It provides the same results of work with rows on different platforms.

source: Внесенные исправления предотвращают данный конфликт, обеспечивая надежное автосохранение пакетов (#9025, #9021, #9038).
en: The introduced fixes enable to prevent such conflict providing reliable auto saving of packages (#9025, #9021, #9038).

source: Внесены изменения в пример:
en: Changes were introduced into the following example:

source: Внесены изменения в работу утилиты BatchLauncher.
en: Changes were introduced into BatchLauncher utilities operation.

source: Внесены исправления в визуализатор диаграмма.
en: Chart Visualizer was corrected.

source: Внесены исправления в соответствующую функцию проверки (#9228).
en: Corresponding check function was corrected (#9228).

source: Внесены необходимые правки (#9260).
en: Required corrections were made (#9260).

source: Внесли исправления (#10069).
en: Corrections were introduced (#10069).

source: Внесли исправления (#10111).
en: Corrections were introduced (#10111).

source: Внесли исправления (#10219).
en: Corrections were introduced (#10219).

source: Внесли исправления (#9244).
en: Corrections were introduced (#9244).

source: Внесли исправления (#9862).
en: Corrections were introduced (#9862).

source: Внесли исправления (#9913).
en: Corrections were introduced (#9913).

source: Внесли исправления в алгоритм активации входного порта узла Фильтр строк (#9508).
en: Activation algorithm of the input port of Row filter node was corrected (#9508).

source: Внесли исправления, теперь пакет открывается без права на сохранение изменений, а пользователь получает соответствующее уведомление (#9861).
en: Corrections were made, and now the package is opened without the right to save changes, and the user receives corresponing message (#9861).

source: Внесли исправления.
en: Corrections were introduced.

source: Внесли исправления: узел экспорта, выполнение которого остановлено, остается серым, а в Панели процессов указывается, что обработка прервана (#10028).
en: Corrections were introduced: the export node execution of which was terminated remained grey, and it was specified in the Processes bar that processing was terminated (#10028).

source: Внесли необходимы правки, чтобы избежать возможных ошибок при отображении заголовков кросс-таблицы Куба (#8708).
en: The required corrections were made to avoid possible errors while displaying the Cube cross table headers (#8708).

source: Внесли необходимые изменения, чтобы в выходном порту "Дополнительные данные" выводилось сообщение об ошибке, связанное с некорректным Content-Type (#7552).
en: The required changes were introduced to display the error message connected with incorrect Content-Type in the output port "Additional data" (#7552).

source: Внесли необходимые исправления (#10039).
en: The required corrections were introduced (#10039).

source: Внесли необходимые исправления (#10065).
en: The required corrections were introduced (#10065).

source: Внесли необходимые исправления (#10164).
en: The required corrections were introduced (#10164).

source: Внесли необходимые исправления (#10174).
en: The required corrections were introduced (#10174).

source: Внесли необходимые исправления (#10207).
en: The required corrections were introduced (#10207).

source: Внесли необходимые исправления (#7377).
en: The required corrections were introduced (#7377).

source: Внесли необходимые исправления (#9361).
en: The required corrections were introduced (#9361).

source: Внесли необходимые исправления (#9587).
en: The required corrections were introduced (#9587).

source: Внесли необходимые исправления (#9616).
en: The required corrections were introduced (#9616).

source: Внесли необходимые исправления (#9628).
en: The required corrections were introduced (#9628).

source: Внесли необходимые исправления (#9679).
en: The required corrections were introduced (#9679).

source: Внесли необходимые исправления (#9937).
en: The required corrections were introduced (#9937).

source: Внесли необходимые исправления, расчет показателей выполняется без потери точности (#9943).
en: The required corrections were introduced, indicators are calculated without loss of accuracy (#9943).

source: Внимание.
en: Please note.

source: Во всех контекстных меню приложения действие по умолчанию выделено жирным шрифтом.
en: The default action is in bold in all context menus of application.

source: Возможность переиспользования компонентов и простота данной операции — одна из самых важных вещей при работе с Loginom.
en: Opportuniity to reuse components and ease of this operation is one of the most important features of the Loginom operation.

source: Возможность публикация веб-сервисов для редакции Team
en: Option of web services publication for the Team edition

source: Все лишние производные компоненты можно удалить вручную, после чего сохранить пакет.
en: All excessive derived components can be manually deleted. Then a package can be saved.

source: Входной набор данных при этом поступал из узлов Импорта LGD, TXT, Excel или из Цикла (#9612).
en: In this case, the input data set came from LGD, TXT, Excel import or from Loop nodes (#9612).

source: Выполнена оптимизация запроса списка папок файлового хранилища (#8551).
en: Request of the file storage folders list was optimised (#8551).

source: Выходной порт переменных «Сводка» дополнен показателями: для линейной регрессии — Логарифм функции правдоподобия, Стандартное отклонение, Число степеней свободы ошибки, F-статистика; для логистической регрессии — Число степеней свободы ошибки, -2 Логарифма функции правдоподобия нулевой модели.
en: The following parameters are added for the "Summary" output port of variables: for the linear regression — Log-likelihood, Standard deviation, Degrees of freedom for error, F-statistic; for the logistic regression — Degrees of freedom for error, -2 Log-likelihood of null model.

source: Данная возможность работает в окне быстрого просмотра на панели сценария, при быстром просмотре содержимого выходных портов, при быстром просмотре результатов в калькуляторе, а также в инспекторе свойств.
en: This option is available in the quick view window on the workflow panel for the quick view of the output ports content, quick view of results in the calculator and property inspector.

source: Данное изменение затрагивает следующие обработчики: Импорт из тестового файла, Импорт из файла Excel, Импорт из Базы данных, Импорт из 1С Запрос, Импорт из XML файла, JavaScript, Python, Извлечение XML, SOAP-запрос, Кросс-таблица, Таблица в дерево, а также порт типа «Дерево данных».
en: This change applies to the following handlers: Import from text file, Import from Excel file, Import from Database, Import from 1С Request, Import from XML file, JavaScript, Python, XML Extraction, SOAP request, Cross chart, Table to tree, and also "Data tree" type port.

source: Данное ограничение соответствует ограничению на имена папок в Windows.
en: This restriction complies with the restriction concerning the folder names in Windows.

source: Данный функционал особенно актуален при работе со сложными формулами.
en: This functionality is particular relevant when working with complex formulae.

source: Действие опции распространяется на компоненты:
en: The option effect extends to the following components:

source: Детализация визуализатора Качество данных
en: Detailing of the Data Quality Visualizer

source: Для REST ответов реализован формат, соответствующий RFC 7807.
en: The format that matches RFC 7807 was implemented for RESR responses.

source: Для SOAP-сервисов внесены некоторые изменения в структуру элементов.
en: Some changes were introduced into the element structure for SOAP services.

source: Для csv-файлов в качестве разделителя столбцов по умолчанию теперь выставляется не запятая, а берётся из локали параметр «Разделитель элемента списка» (по умолчанию это «;»).
en: Now, not comma is used as the default column delimiter for csv files. "List item delimiter" parameter is taken from locale (it is ";" by default).

source: Для автоматического определения параметров просматриваются все строки, указанные пользователем для анализа (по умолчанию установлено 25 строк).
en: To provide the automatic definition of parameters, all rows selected by a user for analysis are viewed (25 rows are set by default).

source: Для баз данных в других кодировках в запросах со строками, содержащими не поддерживаемые кодировкой БД символы, нужно добавлять префикс N перед строковым литералом (N'строка').
en: It is required to add N prefix before the string literal (N'string') for the databases with other encoding in the requests with the strings containing the characters not supported by the database encoding.

source: Для версии под Linux добавлена возможность вывода логов Loginom Integrator в journald.
en: It became possible to output Loginom Integrator logs to journald for the Linux version.

source: Для всех вновь создаваемых узлов будет действовать следующая логика: если настройка «Уникальные значения как имена полей» активна, то валидные уникальные значения будут без изменений использоваться как имена столбцов, а невалидные уникальные значения будут формироваться с помощью транслитерации.
en: The following logics will be used for all newly created nodes: if "Unique values as field names" setting is active, the valid unique values will be used without changes as the column names, and the invalid unique values will be generated using transliteration.

source: Для всех редакций значение этого параметра по умолчанию %ProgramData%\Loginom\Server\loginomd.socket.
en: The default value of this parameter for all editions is %ProgramData%\Loginom\Server\loginomd.socket.

source: Для запуска узла в режиме Пакетного выполнения требуется задать для него имя, при этом узел не обязательно должен быть опубликован.
en: To start the node in the Batch processing mode, it is required to set its name, and the node must not be compulsorily published.

source: Для защищенных соединений используется OpenSSL версии 1.1.
en: OpenSSL 1.1 is used for the secure connections.

source: Для интеграции с 1С:Предприятие можно использовать альтернативные механизмы, например, HTTP-протокол.
en: To provide integration with 1С:Enterprise, it is possible to use alternative mechanisms, for example, HTTP protocol.

source: Для их расчета необходимо выполнить действие «Посчитать показатели качества».
en: To calculate them, it is required to perform the following action: "Calculate quality indicators".

source: Для каждого опубликованного пакета генерируется отдельный wsdl-файл (ранее описание SOAP-сервиса включало содержимое всех опубликованных пакетов).
en: A separate wsdl file is generated for each published package (the earlier description of the SOAP service included content of all published packages).

source: Для каждого пакета отображается список всех опубликованных узлов.
en: List of all published nodes is displayed for each package.

source: Для методов, которые изначально требуют наличие всех коэффициентов (Enter, Backward, Ridge, LASSO и ElasticNet), будет выдана ошибка до момента обучения модели, если число строк меньше числа коэффициентов (включая константу).
en: The error will be shown for the methods that initially require availability of all coefficients (Enter, Backward, Ridge, LASSO и ElasticNet) up to the moment of model training if the row count is less than the count of coefficients (including the intercept).

source: Для пакетов, созданных до версии 6.4.0, в порту «Дополнительные данные» узла REST-запрос изменится выходной набор данных.
en: The output data set will be changed for the packages created before version 6.4.0 in the "Additional data" port of the REST service node.

source: Для параметра Максимальное количество классов установлен диапазон допустимых значений [1, 1000] (#6627, #9198).
en: The range of allowed values equal to [1, 1000] was set for the Maximum class count parameter (#6627, #9198).

source: Для переиспользования компонентов достаточно в контекстном меню узла выбрать подменю «Создать производный компонент».
en: It is sufficient to select "Create derived component" submenu in the context menu of the node to reuse the components.

source: Для повышения удобства работы аналитиков, в Loginom 6.5 реализован быстрый просмотр при выделении активизированного узла, без открытия дополнительных окон.
en: To provide usability improvements of the analyst work, quick view when selecting the activated node without additional windows opening was implemented in Loginom 6.5.

source: Для работы компонента Python на сервере должен быть установлен Python версии 3.4 или выше, а также все пакеты, которые планируется использовать в работе.
en: Python 3.4 and higher and also all packages to be used in the operation process must be installed on server for the Python component operation.

source: Для работы метода логирования необходима библиотека systemd.so.0 (она гарантировано имеется, если в дистрибутиве Linux используется система инициализации systemd).
en: systemd.so.0 library is required to use the logging method (it is available for sure if systemd initialization system is used in Linux distribution kit).

source: Для работы необходимо задать входные и выходные наборы полей, а далее компонент автоматически выявляет полные дубли и противоречия в наборе данных.
en: For operation, it is required to set the input and output data sets of fields, and then the component automatically detects full doubles and contradictions in the data set.

source: Для решения этих задач в раздел Администрирование добавлен «Диспетчер», который может использоваться для просмотра открытых сессий и пакетов, мониторинга и управления их активностью.
en: To tackle these tasks, "Session Manager" that can be used to view the opened sessions and packages and for their monitoring and activity control was added to Administration section.

source: Для сброса имени узла достаточно оставить поле пустым (возможно только для модификатора доступа «Открытый»).
en: To reset the node name, it is sufficient to leave the field blank (it is possible only for the "Public" access modifier).

source: Для старых пакетов будет использован тот же формат сообщений, что и для новых.
en: The same message format as for the new packages will be used for the old ones .

source: Для того, чтобы на сервере можно было создать общую папку, доступ к которой имели бы все пользователи, в том числе вновь добавляемые, создана стандартная группа пользователей «Все», которая отображается при настройке прав на общие папки.
en: To create the shared folder with the access rights provided for all users, including the newly added ones, on server, the standard user group "All" displayed when configuring the shared folders rights was created.

source: Для того, чтобы обеспечить обратную совместимость с пакетами, разработанными в предыдущих версиях платформы, реализован механизм конвертации сценариев.
en: To provide the backward compatibility with the packages designed in the previous platform version, the workflow conversion mechanism was implemented.

source: Для того, чтобы у прежде установленного сервера задействовать кодировку UTF8, нужно сделать резервную копию лог-файла app.log, а затем удалить его.
en: To use UTF8 encoding of the earlier installed server, it is required to make a backup copy of app.log log file and then delete it.

source: Для узлов «Переменные сценария» и «Входной/Выходной узел Подмодели» скрыты пункты меню «Настройка модификатора доступа» и «Удалить узел».
en: "Configure visibility" and "Delete node" menu items are hidden for "Workflow Variables" and "Input/Output node of the Supernode" nodes.

source: Для устранения проблемы на входном порту обработчика «Таблица в дерево» убрана возможность выставлять «Назначение» (#8571).
en: To solve this problem, possibility to set "Usage type" in the input port of "Table to tree" handler was removed (#8571).

source: Для устранения проблемы на входном порту обработчика убрана возможность выставлять «Назначение» (#8570).
en: To solve this problem, possibility to set "Usage type" in the input port of the handler was removed (#8570).

source: Для устранения этой проблемы в новой версии Loginom 6.5 реализован функционал фиксации локали пакетов.
en: To solve this problem, the package locale fixation functionality was implemented in the new Loginom 6.5 version.

source: Для файлов логов Loginom Server по умолчанию используется кодировка UTF8 (ранее использовалась кодировка ANSI).
en: UTF8 (ANSI encoding was used earlier) is used for the Loginom Server logs files by default.

source: Для формирования набора выходных столбцов могут использоваться следующие методы:
en: The following methods can be used to generate a set of the output columns:

source: Для шаговых методов с прямым проходом (Forward или Stepwise) будет произведено включение максимально возможного числа коэффициентов, после чего алгоритм остановится или пойдет обратно в зависимости от его разновидности.
en: Maximum possible count of coefficients will be included for the step-by-step methods with forward pass (Forward or Stepwise). Then the algorithm will stop or return according to its type.

source: Для этого в конфигурационном файле Loginom Integrator у элемента server необходимо добавить атрибут unixsocket, значение которого совпадает со значением параметра "Unix socket", установленного в параметрах подключения на странице "Администрирование" в Loginom Server.
en: For this purpose, for server element in the Loginom Integrator configuration file unixsocket attribute must be added. Its value matches the value of "Unix socket" parameter set in the connection parameters on "Administration" page in Loginom Server.

source: Для этого в мастере настройки импорта из файла вместо имени файла можно указать URL.
en: For this purpose, URL can be specified instead of the file name in import from file wizard.

source: Для этого в мастере настройки полей добавлен параметр «Исключить».
en: For this purpose, such parameter as "Exclude" was added to the fields wizard.

source: Для этого при клике на имя пакета необходимо удерживать клавишу «Ctrl» («Cmd» для MacOS).
en: For this purpose, it is required to hold down "Ctrl" key while clicking on the package name ("Cmd" for MacOS).

source: Для этого реализован перенос такого пакета в сессию пользователя, если он используется только в текущей сессии.
en: For this purpose, it became possible to move such package to the user session if it is used only in the current session.

source: Добавили поддержку NULL-значений для парамеров в параметризированных SELECT-запросах.
en: NULL values support was added for the parameters in parametrized SELECT requests.

source: Добавили поддержку корректного выполнения узлов с сохраняемыми уникальными значениями, обученных в более ранних версиях (#8206).
en: Support of correct execution of nodes with the saved unique values trained in the earlier versions was added (#8206).

source: Добавлен запрос подтверждения от пользователя на деактивацию узла перед началом настройки узла или его портов.
en: User confirmation request to deactivate the node before configuration of the node or its ports was added.

source: Добавлен учёт локали.
en: Locale consideration was added.

source: Добавлена анимированная иконка статуса процессов при наличии активных процессов.
en: The animated icon that shows the status of processes was added in the case of active processes.

source: Добавлена возможность активации узлов JavaScript и Python, порты источников данных которых подключены к неактивным ветвям узла Условие.
en: It became possible to activate JavaScript and Python nodes data sources ports of which are connected to the inactive Condition node branches.

source: Добавлена возможность выполнить автоматическое определение структуры импортируемого файла.
en: The automatic definition of the imported file structure became possible.

source: Добавлена возможность задать расположение файла конфигурации Loginom Integrator.
en: It became possible to set location of Loginom Integrator configuration file.

source: Добавлена возможность наследования для Импорта из Хранилища данных, что может быть полезно в случае, если в нескольких местах используются подключения к одному и тому же Хранилищу данных, но с различными параметрами настройки.
en: Inheritance possibility for Import from the Data Warehouse was added. It can be useful if connections to one and the same Data Warehouse with different configuration parameters are used in several places.

source: Добавлена возможность подключаться к Loginom Server по Unix domain socket.
en: Now it is possible to connect to Loginom Server via Unix domain socket.

source: Добавлена возможность подключения через ODBC-драйверы для СУБД Apache Hive с использованием строки подключения.
en: Connection via ODBC drivers for Apache Hive DBMS using connection strings was added.

source: Добавлена возможность установки встроенного клиента Firebird.
en: It became possible to install inbuilt Firebird client.

source: Добавлена генерация корневого wsdl-документа, который ссылается на все остальные wsdl-документы.
en: Generation of root wsdl document that refers to all other wsdl documents was added.
